### Import required dependencies

In [5]:
import pandas as pd
import os
import numpy as np

## Deliverable 1: Collect the Data

To collect the data that youâ€™ll need, complete the following steps:

1. Using the Pandas `read_csv` function and the `os` module, import the data from the `new_full_student_data.csv` file, and create a DataFrame called student_df. 

2. Use the head function to confirm that Pandas properly imported the data.

In [13]:
# Create the path and import the data
full_student_data = os.path.join('new_student_data.csv')
student_df = pd.read_csv(full_student_data)

In [60]:
# Verify that the data was properly imported
student_df.head()

# Student_df.tail()

,student_id,student_name,grade,school_name,reading_score,math_score,school_type
0,127008367,Sarah Douglas,11,Chang High School,87.2,64.1,Public
2,44359500,Ryan Haas,12,Campbell High School,91.6,54.7,Public
3,24791243,Kathryn Mack,11,Richard High School,68.9,73.3,Charter
4,121467881,Harold Reynolds,12,Chang High School,68.7,43.4,Public
5,79397676,Kyle Brooks,9,Turner High School,72.6,55.4,Public

## Deliverable 2: Prepare the Data

To prepare and clean your data for analysis, complete the following steps:
    
1. Check for and remove all rows with `NaN`, or missing, values in the student DataFrame. 

2. Check for and remove all duplicate rows in the student DataFrame.

3. Use the `str.replace` function to remove the "th" from the grade levels in the grade column.

4. Check data types using the `dtypes` property.

5. Remove the "th" suffix from every value in the grade column using `str` and `replace`.

6. Change the grade colum to the `int` type and verify column types.

7. Use the head (and/or the tail) function to preview the DataFrame.

In [29]:
# Check for null values
student_df.isna().sum()

student_id          0
student_name        0
grade               0
school_name         0
reading_score    1414
math_score        705
school_type         0
dtype: int64

In [35]:
# Drop rows with null values and verify removal
student_df = student_df.dropna(how='all')
student_df.isna().sum()

student_id       0
student_name     0
grade            0
school_name      0
reading_score    0
math_score       0
school_type      0
dtype: int64

In [36]:
# Check for duplicated rows
student_df.duplicated().sum()

1299

In [37]:
# Drop duplicated rows and verify removal
student_df = student_df.drop_duplicates()

In [38]:
# Check data types
student_df.dtypes

student_id         int64
student_name      object
grade             object
school_name       object
reading_score    float64
math_score       float64
school_type       object
dtype: object

In [39]:
# Examine the grade column to understand why it is not an int
student_df['grade']
# The th is causing it to be an object.

0        11th
2        12th
3        11th
4        12th
5         9th
         ...
13935    10th
13936    10th
13937     9th
13938    10th
13939    11th
Name: grade, Length: 10604, dtype: object

In [40]:
# Remove the non-numeric characters and verify the contents of the column
student_df['grade'] = student_df['grade'].str.replace('th', '')

In [44]:
# Change the grade column to the int type and verify column types
student_df['grade'] = student_df['grade'].astype(int)
student_df.dtypes

student_id         int64
student_name      object
grade              int64
school_name       object
reading_score    float64
math_score       float64
school_type       object
dtype: object

## Deliverable 3: Summarize the Data

Describe the data using summary statistics on the data as a whole and on individual columns.

1. Generate the summary statistics for each DataFrame by using the `describe` function.

2. Display the mean math score using the `mean` function. 

2. Store the minimum reading score as `min_reading_score`.

In [45]:
# Display summary statistics for the DataFrame
student_df.describe()

         student_id         grade  reading_score    math_score
count  1.060400e+04  10604.000000   10604.000000  10604.000000
mean   6.971953e+07     10.566013      75.241513     64.343248
std    3.470851e+07      1.128907      14.283955     16.662284
min    1.000132e+07      9.000000       9.500000      1.400000
25%    3.974626e+07     10.000000      65.900000     52.700000
50%    6.996368e+07     11.000000      76.400000     65.000000
75%    9.984440e+07     12.000000      86.300000     76.400000
max    1.299903e+08     12.000000     100.000000    100.000000

In [46]:
# Display the mean math score using the mean function
student_df.mean()

/var/folders/50/glznch0579vbxddqhnfkwnk40000gn/T/ipykernel_34209/969459584.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  student_df.mean()

student_id       6.971953e+07
grade            1.056601e+01
reading_score    7.524151e+01
math_score       6.434325e+01
dtype: float64

In [85]:
# Store the minimum reading score as min_reading_score
min_math_score = student_df['math_score'].min()
min_math_score

1.4

## Deliverable 4: Drill Down into the Data

Drill down to specific rows, columns, and subsets of the data.

To drill down into the data, complete the following steps:

1. Use `loc` to display the grade column.

2. Use `iloc` to display the first 3 rows and columns 3, 4, and 5.

3. Show the rows for grade nine using `loc`.

4. Store the row with the minimum overall reading score as `min_reading_row` using `loc` and the `min_reading_score` found in Deliverable 3.

5. Find the reading scores for the school and grade from the output of step three using `loc` with multiple conditional statements.

6. Using conditional statements and `loc` or `iloc`, find the mean reading score for all students in grades 11 and 12 combined.

In [77]:
# Use loc to display the grade column
student_df.loc[:, "grade"]

0        11
2        12
3        11
4        12
5         9
         ..
13935    10
13936    10
13937     9
13938    10
13939    11
Name: grade, Length: 10604, dtype: int64

In [102]:
# Use `iloc` to display the first 3 rows and columns 3, 4, and 5.
student_df.iloc[0:3, [3,4,5]]

            school_name  reading_score  math_score
0     Chang High School           87.2        64.1
2  Campbell High School           91.6        54.7
3   Richard High School           68.9        73.3

In [160]:
# Select the rows for grade nine and display their summary statistics using `loc` and `describe`.
grade_df = student_df.loc[student_df["grade"] == 9]
grade_df.describe()

         student_id   grade  reading_score   math_score
count  2.542000e+03  2542.0    2542.000000  2542.000000
mean   7.021980e+07     9.0      77.796027    68.821676
std    3.482374e+07     0.0      13.149032    16.137150
min    1.002379e+07     9.0      19.900000    10.000000
25%    4.027663e+07     9.0      69.625000    58.625000
50%    7.013517e+07     9.0      79.100000    70.600000
75%    1.004694e+08     9.0      87.900000    80.475000
max    1.299257e+08     9.0     100.000000   100.000000

In [162]:
# Store the row with the minimum overall reading score as `min_reading_row`
# using `loc` and the `min_reading_score` found in Deliverable 3.
min_reading_score = student_df["reading_score"].min()
min_reading_row = student_df.loc[student_df["reading_score"] == min_reading_score]
min_reading_row

,student_id,student_name,grade,school_name,reading_score,math_score,school_type
3630,101306483,Colleen Chapman,10,Richard High School,9.5,46.7,Charter

In [228]:
# Use loc with conditionals to select all reading scores from 10th graders at Dixon High School.
reading_scores = student_df.loc[(student_df['school_name'] == 'Dixon High School') & (student_df['reading_score'] == '10'), ['school_name', 'reading_score']]
reading_scores = student_df

In [207]:
# Find the mean reading score for all students in grades 11 and 12 combined.
student_df.loc[student_df["grade"] == "11,12" "reading_score"].mean()

student_id       NaN
student_name     NaN
grade            NaN
school_name      NaN
reading_score    NaN
math_score       NaN
school_type      NaN
dtype: object

## Deliverable 5: Make Comparisons Between District and Charter Schools

Compare district vs charter schools for budget, size, and scores.

Make comparisons within your data by completing the following steps:

1. Using the `groupby` and `mean` functions, look at the average reading and math scores per school type.

1. Using the `groupby` and `count` functions, find the total number of students at each school.

2. Using the `groupby` and `mean` functions, find the average budget per grade for each school type.

In [31]:
# Use groupby and mean to find the average reading and math scores for each school type.

             school_budget
school_type
Charter      872625.656236
Public       911195.558251

In [22]:
# Use the `groupby`, `count`, and `sort_values` functions to find the
# total number of students at each school and sort from most students to least students.

                        student_count
school_name
Montgomery High School           2038
Green High School                1961
Dixon High School                1583
Wagner High School               1541
Silva High School                1109
Woods High School                1052
Sullivan High School              971
Turner High School                846
Bowers High School                803
Fisher High School                798
Richard High School               551
Campos High School                541
Odonnell High School              459
Campbell High School              407
Chang High School                 171

                   math_score
school_type grade
Charter     9            70.0
            10           66.0
            11           68.0
            12           60.0
Public      9            64.0
            10           64.0
            11           59.0
            12           64.0

# Deliverable 6: Summarize Your Findings
In the cell below, write a few sentences to describe any discoveries you made while performing your analysis along with any additional analysis you believe would be worthwhile.

*your summary here*